---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunOuterDiamParam
source: html/2b6fcdfd-e0f9-14e6-8ab8-75e8218279f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunOuterDiamParam Property

"Outside Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConduitrunOuterDiamParam { get; }
```